# data_handler

> This module handles data load and transformations.

First, we need to download data from an API.

In [ ]:
#| default_exp data_handler

In [ ]:
#| export
def some_api_call():
    """This function replicates an API call that returns a list of data."""
    return [45, 37, 35, 30, 31, 28, 27, 33, 35, 34, 52, 56,
             67, 80, 82, 81, 76, 96, 100, 101, 78, 52, 48, 46]

In [ ]:
data = some_api_call()

Head of the data for an example:

In [ ]:
data[0:6]

[45, 37, 35, 30, 31, 28]

In [ ]:
#| hide
assert len(data) == 24

## Data Transformations

We need to transform this data into a pandas dataframe.

In [ ]:
#| export
import pandas as pd

In [ ]:
#| export
def transform_data(data: list # List of hourly prices
                  ):
    """Transforms data into dataframe with hours defined."""
    hours = [x for x in range(0, 24, 1)]
    df = pd.DataFrame({'time': hours, 'price': data})
    return df

In [ ]:
#| export
def convert_to_float(data: pd.DataFrame # Hourly prices dataframe
                    ):
    """Converts price column to float type."""
    data['price'] = data['price'].astype(float)
    return data

Transform the data.

In [ ]:
df = transform_data(data)
df.head()

   time  price
0     0     45
1     1     37
2     2     35
3     3     30
4     4     31

Transform price column to float type.

In [ ]:
df = convert_to_float(df)
df.head()

   time  price
0     0   45.0
1     1   37.0
2     2   35.0
3     3   30.0
4     4   31.0

In [ ]:
#| hide
assert df['price'].dtype == float